---
type: LocationPoint
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LocationPoint

`Autodesk.Revit.DB.LocationPoint` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Point | — | `public XYZ Point { get ; set ; }` |
| Property | Rotation | — | `public double Rotation { get ; }` |